doc/AS24_WS_Search.xml

<wsdl:definitions name="ArticleSearchFacade" targetNamespace="http://www.autoscout24.com/webapi/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://www.autoscout24.com/webapi/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xsd:schema targetNamespace="http://www.autoscout24.com/webapi/Imports"><xsd:import namespace="http://www.autoscout24.com/webapi/" schemaLocation="http://api.autoscout24.com/ssg/wsdl/Search.svc?serviceoid=227442735&amp;servdocoid=9445212160"/><xsd:import namespace="http://schemas.microsoft.com/2003/10/Serialization/" schemaLocation="http://api.autoscout24.com/ssg/wsdl/Search.svc?serviceoid=227442735&amp;servdocoid=9445212162"/><xsd:import namespace="http://www.autoscout24.com/webapi/data/" schemaLocation="http://api.autoscout24.com/ssg/wsdl/Search.svc?serviceoid=227442735&amp;servdocoid=9445212161"/></xsd:schema></wsdl:types><wsdl:message name="IArticleSearch_FindArticles_InputMessage"><wsdl:part element="tns:FindArticles" name="parameters"/></wsdl:message><wsdl:message name="IArticleSearch_FindArticles_OutputMessage"><wsdl:part element="tns:FindArticlesResponse" name="parameters"/></wsdl:message><wsdl:message name="IArticleSearch_GetArticleDetails_InputMessage"><wsdl:part element="tns:GetArticleDetails" name="parameters"/></wsdl:message><wsdl:message name="IArticleSearch_GetArticleDetails_OutputMessage"><wsdl:part element="tns:GetArticleDetailsResponse" name="parameters"/></wsdl:message><wsdl:message name="IArticleSearch_GetCustomerArticleList_InputMessage"><wsdl:part element="tns:GetCustomerArticleList" name="parameters"/></wsdl:message><wsdl:message name="IArticleSearch_GetCustomerArticleList_OutputMessage"><wsdl:part element="tns:GetCustomerArticleListResponse" name="parameters"/></wsdl:message><wsdl:message name="IArticleSearch_GetCustomerArticleDetails_InputMessage"><wsdl:part element="tns:GetCustomerArticleDetails" name="parameters"/></wsdl:message><wsdl:message name="IArticleSearch_GetCustomerArticleDetails_OutputMessage"><wsdl:part element="tns:GetCustomerArticleDetailsResponse" name="parameters"/></wsdl:message><wsdl:message name="IArticleSearch_SendContactMessage_InputMessage"><wsdl:part element="tns:SendContactMessage" name="parameters"/></wsdl:message><wsdl:message name="IArticleSearch_SendContactMessage_OutputMessage"><wsdl:part element="tns:SendContactMessageResponse" name="parameters"/></wsdl:message><wsdl:portType name="IArticleSearch"><wsdl:operation name="FindArticles"><wsdl:input message="tns:IArticleSearch_FindArticles_InputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/FindArticles"/><wsdl:output message="tns:IArticleSearch_FindArticles_OutputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/FindArticlesResponse"/></wsdl:operation><wsdl:operation name="GetArticleDetails"><wsdl:input message="tns:IArticleSearch_GetArticleDetails_InputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/GetArticleDetails"/><wsdl:output message="tns:IArticleSearch_GetArticleDetails_OutputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/GetArticleDetailsResponse"/></wsdl:operation><wsdl:operation name="GetCustomerArticleList"><wsdl:input message="tns:IArticleSearch_GetCustomerArticleList_InputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/GetCustomerArticleList"/><wsdl:output message="tns:IArticleSearch_GetCustomerArticleList_OutputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/GetCustomerArticleListResponse"/></wsdl:operation><wsdl:operation name="GetCustomerArticleDetails"><wsdl:input message="tns:IArticleSearch_GetCustomerArticleDetails_InputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/GetCustomerArticleDetails"/><wsdl:output message="tns:IArticleSearch_GetCustomerArticleDetails_OutputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/GetCustomerArticleDetailsResponse"/></wsdl:operation><wsdl:operation name="SendContactMessage"><wsdl:input message="tns:IArticleSearch_SendContactMessage_InputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/SendContactMessage"/><wsdl:output message="tns:IArticleSearch_SendContactMessage_OutputMessage" wsaw:Action="http://www.autoscout24.com/webapi/IArticleSearch/SendContactMessageResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IArticleSearch" type="tns:IArticleSearch"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="FindArticles"><soap:operation soapAction="http://www.autoscout24.com/webapi/IArticleSearch/FindArticles" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetArticleDetails"><soap:operation soapAction="http://www.autoscout24.com/webapi/IArticleSearch/GetArticleDetails" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetCustomerArticleList"><soap:operation soapAction="http://www.autoscout24.com/webapi/IArticleSearch/GetCustomerArticleList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetCustomerArticleDetails"><soap:operation soapAction="http://www.autoscout24.com/webapi/IArticleSearch/GetCustomerArticleDetails" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SendContactMessage"><soap:operation soapAction="http://www.autoscout24.com/webapi/IArticleSearch/SendContactMessage" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="ArticleSearchFacade"><wsdl:port binding="tns:BasicHttpBinding_IArticleSearch" name="BasicHttpBinding_IArticleSearch"><soap:address location="http://api.autoscout24.com/AS24_WS_Search"/></wsdl:port></wsdl:service></wsdl:definitions>