doc/soap_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.autoscout24.com/webapi/" xmlns:data="http://www.autoscout24.com/webapi/data/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:FindArticles>
         <!--Optional:-->
         <web:request>
            <!--Optional:-->
            <data:client_id>?</data:client_id>
            <!--Optional:-->
            <data:culture_id>?</data:culture_id>
            <!--Optional:-->
            <data:profile_id>?</data:profile_id>
            <!--Optional:-->
            <data:revision>?</data:revision>
            <!--Optional:-->
            <data:session_id>?</data:session_id>
            <!--Optional:-->
            <data:vehicle_search_parameters>
               <!--Optional:-->
               <data:accident_free>?</data:accident_free>
               <!--Optional:-->
               <data:address>
                  <!--Optional:-->
                  <data:countries>
                     <!--Zero or more repetitions:-->
                     <data:country_id>?</data:country_id>
                  </data:countries>
                  <!--Optional:-->
                  <data:geo_position>
                     <!--Optional:-->
                     <data:latitude>?</data:latitude>
                     <!--Optional:-->
                     <data:longitude>?</data:longitude>
                  </data:geo_position>
                  <!--Optional:-->
                  <data:radius>?</data:radius>
                  <!--Optional:-->
                  <data:zip_code>?</data:zip_code>
                  <!--Optional:-->
                  <data:zip_country_id>?</data:zip_country_id>
               </data:address>
               <!--Optional:-->
               <data:as24_customer_id>?</data:as24_customer_id>
               <!--Optional:-->
               <data:availability>
                  <!--Optional:-->
                  <data:begin>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:begin>
                  <!--Optional:-->
                  <data:last_change>
                     <!--Optional:-->
                     <data:to>?</data:to>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:last_change>
               </data:availability>
               <!--Optional:-->
               <data:bodies>
                  <!--Zero or more repetitions:-->
                  <data:body_id>?</data:body_id>
               </data:bodies>
               <!--Optional:-->
               <data:body_colorgroups>
                  <!--Zero or more repetitions:-->
                  <data:body_colorgroup_id>?</data:body_colorgroup_id>
               </data:body_colorgroups>
               <!--Optional:-->
               <data:body_paintings>
                  <!--Zero or more repetitions:-->
                  <data:body_painting_id>?</data:body_painting_id>
               </data:body_paintings>
               <!--Optional:-->
               <data:brands>
                  <!--Zero or more repetitions:-->
                  <data:brand_id>?</data:brand_id>
               </data:brands>
               <!--Optional:-->
               <data:categories>
                  <!--Zero or more repetitions:-->
                  <data:category_id>?</data:category_id>
               </data:categories>
               <!--Optional:-->
               <data:covering>
                  <!--Zero or more repetitions:-->
                  <data:covering_id>?</data:covering_id>
               </data:covering>
               <!--Optional:-->
               <data:dealer_id>?</data:dealer_id>
               <!--Optional:-->
               <data:doors>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
               </data:doors>
               <!--Optional:-->
               <data:emission>
                  <!--Optional:-->
                  <data:class_id>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:class_id>
                  <!--Optional:-->
                  <data:sticker_id>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:sticker_id>
               </data:emission>
               <!--Optional:-->
               <data:equipments>
                  <!--Zero or more repetitions:-->
                  <data:equipment_id>?</data:equipment_id>
               </data:equipments>
               <!--Optional:-->
               <data:export_third_party_listings>?</data:export_third_party_listings>
               <!--Optional:-->
               <data:financing>
                  <!--Optional:-->
                  <data:duration>
                     <!--Optional:-->
                     <data:to>?</data:to>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:duration>
                  <!--Optional:-->
                  <data:eff_rate_of_interest>
                     <!--Optional:-->
                     <data:to>?</data:to>
                  </data:eff_rate_of_interest>
                  <!--Optional:-->
                  <data:ending_rate_value>
                     <!--Optional:-->
                     <data:to>?</data:to>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:ending_rate_value>
                  <!--Optional:-->
                  <data:initial_payment_value>
                     <!--Optional:-->
                     <data:to>?</data:to>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:initial_payment_value>
                  <!--Optional:-->
                  <data:rate_value>
                     <!--Optional:-->
                     <data:to>?</data:to>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:rate_value>
               </data:financing>
               <!--Optional:-->
               <data:fuel_types>
                  <!--Zero or more repetitions:-->
                  <data:fuel_type_id>?</data:fuel_type_id>
               </data:fuel_types>
               <!--Optional:-->
               <data:gear_type_ids>
                  <!--Zero or more repetitions:-->
                  <data:gear_type_id>?</data:gear_type_id>
               </data:gear_type_ids>
               <!--Optional:-->
               <data:general_inspection>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
               </data:general_inspection>
               <!--Optional:-->
               <data:group_id>?</data:group_id>
               <!--Optional:-->
               <data:initial_registration>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
               </data:initial_registration>
               <!--Optional:-->
               <data:interior_color>
                  <!--Zero or more repetitions:-->
                  <data:interior_color_id>?</data:interior_color_id>
               </data:interior_color>
               <!--Optional:-->
               <data:kilowatt>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
               </data:kilowatt>
               <!--Optional:-->
               <data:leasing>
                  <!--Optional:-->
                  <data:duration>
                     <!--Optional:-->
                     <data:to>?</data:to>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:duration>
                  <!--Optional:-->
                  <data:eff_rate_of_interest>
                     <!--Optional:-->
                     <data:to>?</data:to>
                  </data:eff_rate_of_interest>
                  <!--Optional:-->
                  <data:ending_rate_value>
                     <!--Optional:-->
                     <data:to>?</data:to>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:ending_rate_value>
                  <!--Optional:-->
                  <data:initial_payment_value>
                     <!--Optional:-->
                     <data:to>?</data:to>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:initial_payment_value>
                  <!--Optional:-->
                  <data:rate_value>
                     <!--Optional:-->
                     <data:to>?</data:to>
                     <!--Optional:-->
                     <data:from>?</data:from>
                  </data:rate_value>
                  <!--Optional:-->
                  <data:takeover>?</data:takeover>
               </data:leasing>
               <!--Optional:-->
               <data:mileage>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
               </data:mileage>
               <!--Optional:-->
               <data:model_lines>
                  <!--Zero or more repetitions:-->
                  <data:model_line_id>?</data:model_line_id>
               </data:model_lines>
               <!--Optional:-->
               <data:models>
                  <!--Zero or more repetitions:-->
                  <data:model_id>?</data:model_id>
               </data:models>
               <!--Optional:-->
               <data:owners_offer_key>?</data:owners_offer_key>
               <!--Optional:-->
               <data:paging>
                  <!--Optional:-->
                  <data:current_page>?</data:current_page>
                  <!--Optional:-->
                  <data:results_per_page>?</data:results_per_page>
               </data:paging>
               <!--Optional:-->
               <data:previous_owner_count>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
               </data:previous_owner_count>
               <!--Optional:-->
               <data:price_dealer>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
                  <!--Optional:-->
                  <data:vat_type_id>?</data:vat_type_id>
               </data:price_dealer>
               <!--Optional:-->
               <data:price_public>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
                  <!--Optional:-->
                  <data:vat_type_id>?</data:vat_type_id>
               </data:price_public>
               <!--Optional:-->
               <data:seal_classes>
                  <!--Zero or more repetitions:-->
                  <data:seal_class_id>?</data:seal_class_id>
               </data:seal_classes>
               <!--Optional:-->
               <data:seals>
                  <!--Zero or more repetitions:-->
                  <data:seal_id>?</data:seal_id>
               </data:seals>
               <!--Optional:-->
               <data:seats>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
               </data:seats>
               <!--Optional:-->
               <data:show_dealer_vehicles>?</data:show_dealer_vehicles>
               <!--Optional:-->
               <data:show_private_vehicles>?</data:show_private_vehicles>
               <!--Optional:-->
               <data:show_with_images_only>?</data:show_with_images_only>
               <!--Optional:-->
               <data:sorting>
                  <!--Optional:-->
                  <data:descending>?</data:descending>
                  <!--Optional:-->
                  <data:first_brand_id>?</data:first_brand_id>
                  <!--Optional:-->
                  <data:key>?</data:key>
               </data:sorting>
               <!--Optional:-->
               <data:vehicle_types>
                  <!--Zero or more repetitions:-->
                  <data:vehicle_type_id>?</data:vehicle_type_id>
               </data:vehicle_types>
               <!--Optional:-->
               <data:version>?</data:version>
               <!--Optional:-->
               <data:ccm>
                  <!--Optional:-->
                  <data:to>?</data:to>
                  <!--Optional:-->
                  <data:from>?</data:from>
               </data:ccm>
            </data:vehicle_search_parameters>
         </web:request>
      </web:FindArticles>
   </soapenv:Body>
</soapenv:Envelope>
